///:
/*****************************************************************************
 **                                                                         **
 **                               .======.                                  **
 **                               | INRI |                                  **
 **                               |      |                                  **
 **                               |      |                                  **
 **                      .========'      '========.                         **
 **                      |   _      xxxx      _   |                         **
 **                      |  /_;-.__ / _\  _.-;_\  |                         **
 **                      |     `-._`'`_/'`.-'     |                         **
 **                      '========.`\   /`========'                         **
 **                               | |  / |                                  **
 **                               |/-.(  |                                  **
 **                               |\_._\ |                                  **
 **                               | \ \`;|                                  **
 **                               |  > |/|                                  **
 **                               | / // |                                  **
 **                               | |//  |                                  **
 **                               | \(\  |                                  **
 **                               |  ``  |                                  **
 **                               |      |                                  **
 **                               |      |                                  **
 **                               |      |                                  **
 **                               |      |                                  **
 **                   \\    _  _\\| \//  |//_   _ \// _                     **
 **                  ^ `^`^ ^`` `^ ^` ``^^`  `^^` `^ `^                     **
 **                                                                         **
 **                    Copyright © 1997-2013 by Tong G.                     **
 **                          ALL RIGHTS RESERVED.                           **
 **                                                                         **
 ****************************************************************************/

#pragma once
#include <QSplitter>

class _NoteEditorSplitter : public QSplitter
    {
    Q_OBJECT

public:
    _NoteEditorSplitter(Qt::Orientation _Orientation,
                        QWidget* _Parent = nullptr);

    /* 设置当前编辑窗口所属的笔记的名称 */
    void _SetParentNoteName(const QString& _NoteName);
    /* 获取当前编辑窗口所属的笔记的名称 */
    QString _GetParentNoteName() const;

    /* 设置该编辑窗口被移动到废纸篓前的父笔记本的名称 */
    void _SetBeforeDeletedParentNoteName(const QString& _NoteName);
    /* 获取该编辑窗口被移动到废纸篓前的父笔记本的名称 */
    QString _GetBeforeDeletedParentNoteName() const;

protected:
    QString m_ParentNoteName_Current;
    QString m_ParentNoteName_BeforeDeleted;
    };

 ////////////////////////////////////////////////////////////////////////////

 /***************************************************************************
 **                                                                        **
 **      _________                                      _______            **
 **     |___   ___|                                   / ______ \           **
 **         | |     _______   _______   _______      | /      |_|          **
 **         | |    ||     || ||     || ||     ||     | |    _ __           **
 **         | |    ||     || ||     || ||     ||     | |   |__  \          **
 **         | |    ||     || ||     || ||     ||     | \_ _ __| |  _       **
 **         |_|    ||_____|| ||     || ||_____||      \________/  |_|      **
 **                                           ||                           **
 **                                    ||_____||                           **
 **                                                                        **
 ***************************************************************************/
///:~

